app/app/controllers/api/v1/bang_controller.rb

SELECT `user_bangs`.* FROM `user_bangs` WHERE (user_id = '1' and from_user_id = 12)
INSERT INTO `user_bangs` (`user_id`, `from_user_id`, `created_at`, `updated_at`) VALUES (1, 12, '2015-06-29 09:32:48', '2015-06-29 09:32:48')
---
  def request_bang
    user_id = params[:id]
    raise Bang::Error::InvalidUserBang if UserBang.conbination(user_id, current_user.id).present?
    raise Bang::Error::InvalidUserBang if UserBang.conbination(current_user.id, user_id).present?

    UserBang.create!(
      user_id: user_id,
      from_user_id: current_user.id
    )

SELECT  `user_bangs`.* FROM `user_bangs` WHERE `user_bangs`.`id` = 3 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
UPDATE `user_bangs` SET `status` = 1, `updated_at` = '2015-06-29 09:34:19' WHERE `user_bangs`.`id` = 3
---
  def reply_bang
    user_bang = UserBang.find_by(id: params[:id])
    raise Bang::Error::InvalidUserBang\
      if !user_bang.present?\
      || user_bang.user_id != current_user.id\
      || user_bang.has_replied?

    user_bang.status = UserBang.status_from_string(params[:status])
    if user_bang.accept?
      create_conversation [user_bang.user_id, user_bang.from_user_id], :user_bang
    end
    user_bang.save!

SELECT `user_bangs`.* FROM `user_bangs` WHERE (user_id = 1 and status = 0)
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def request_list
    request_user_ids = UserBang.request_list(current_user.id).map { |user_bang|
      user_bang.from_user_id
    }
    @users = User.where(id: request_user_ids.uniq)