app/app/controllers/api/v1/conversations_controller.rb

SELECT `conversation_users`.* FROM `conversation_users` WHERE `conversation_users`.`user_id` = 1
SELECT  `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1  ORDER BY updated_at desc LIMIT 20
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
    count = params[:count] || 20

    conversation_ids = ConversationUser.where(user_id: current_user.id).map { |conversation_user|
      conversation_user.conversation_id
    }
    @conversations = conversation_ids.present?\
      ? Conversation.where(id: conversation_ids).order('updated_at desc').limit(count)\
      : []

    belonged_user_ids = @conversations.map { |conversation|
      conversation.belonged_user_ids
    }.flatten

    @users = User.where(id: belonged_user_ids)