app/app/controllers/api/v1/users_controller.rb

  def create
    user = User.find_by(facebook_id: permitted_params[:facebook_id])
    if user.present?
      @user = user
      @is_new = false
    else
      @user = User.create!(permitted_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`facebook_id` = '796755200418503' LIMIT 1
INSERT INTO `users` (`facebook_id`, `name`, `birthday`, `gender`, `encrypted_secret`, `created_at`, `updated_at`) VALUES ('796755200418503', 'Tomoyuki  Takata', '06/21/1980', 1, 'QEVuQwBAEACEg9u2QrwwSWuqVJMpXzk8gaANOYlXMea21T3cX2vzCKJqSo83bJ6ra2RlJ/ubdlWihuBm6wZl/3FfR9eRhCYc86jlCCLMj4mfxxMq8257Zq52Kx36Nm8MgFK9PnVPBno=', '2015-06-06 05:38:34', '2015-06-06 05:38:34')

  def show
    @user = User.find_by(id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def search
    exclusion_user_ids = [current_user.id]
    exclusion_user_ids.push(UserBang.where(user_id: current_user.id).map { |user_bang|
      user_bang.from_user_id
    })
    exclusion_user_ids.push(UserBang.where(from_user_id: current_user.id).map { |user_bang|
      user_bang.user_id
    })
    # TODO : 位置情報などの要素で絞込み(リスティングロジック)の実装
    @users = User.where.not(id: exclusion_user_ids.uniq).limit(50)
---
SELECT `user_bangs`.* FROM `user_bangs` WHERE `user_bangs`.`from_user_id` = 1
SELECT  `users`.* FROM `users` WHERE (`users`.`id` NOT IN (12, 1, 4, 9)) LIMIT 50